/* Напишите программу, которая выводит в консоль небольшой стихотворение:
ОДНАЖДЫ, В СТУДЁНУЮ ЗИМНЮЮ ПОРУ...
Однажды, в студёную зимнюю пору
Я из лесу вышел; был сильный мороз.
Гляжу, поднимается медленно в гору
Лошадка, везущая хворосту воз.
НИКОЛАЙ НЕКРАСОВ */

#include <iostream>

int main()
{
    std::cout << "ОДНАЖДЫ, В СТУДЁНУЮ ЗИМНЮЮ ПОРУ... \n";
    std::cout << "Однажды, в студёную зимнюю пору \n";
    std::cout << "Я из лесу вышел; был сильный мороз. \n";
    std::cout << "Гляжу, поднимается медленно в гору \n";
    std::cout << "Лошадка, везущая хворосту воз. \n";
    std::cout << "НИКОЛАЙ НЕКРАСОВ \n";
}