/*  Напишите три варианта программ, которые выводят текст на экран. Используйте для создания только символы «=», «|» и пробелы. Размер окна может быть любым.*/

#include <iostream>

int main()
{
    std::cout << "================================= \n";
    std::cout << " \n";
    std::cout << "Hello, \n";
    std::cout << "Word\n";
    std::cout << " \n";
    std::cout << "================================= \n";


    std::cout << "=====================================\n";
    std::cout << "||            Hello,               ||\n";
    std::cout << "||            Word                 ||\n";
    std::cout << "=====================================\n";


    std::cout << "=====================================\n";
    std::cout << "||                                 ||\n";
    std::cout << "||                                 ||\n";
    std::cout << "||            Hello,               ||\n";
    std::cout << "||            Word                 ||\n";
    std::cout << "||                                 ||\n";
    std::cout << "||                                 ||\n";
    std::cout << "=====================================\n";

}