/* Дан текст с информацией о персонаже игры. Напишите программу, которая выводит этот текст. Вынесите из текста все числа в переменные, придумайте для них хорошие имена и
выведите на экран.

--------------------------------
Супер гонки. Круг 4
--------------------------------
Шумахер (358)
--------------------------------
Водитель: Шумахер
Скорость: 358
-------------------
Оснащение
Двигатель: +254
Колеса: +93
Руль: +49
-------------------
Действия плохой погоды
Ветер: -21
Дождь: -17 */


#include <iostream>

int main() {
  int lap = 4;
  int speed = 358;
  int engine = 254;
  int wheels = 93;
  int steerinWheel = 49;
  int wind = 21;
  int rain = 17;

  std::cout << "=======================\n";
  std::cout << "Супер гонки. Круг " << lap << "\n";
  std::cout << "=======================\n";
  std::cout << "Шумахер (" << speed << ")\n";        
  std::cout << "=======================\n";
  std::cout << "Водитель: Шумахер \n";                
  std::cout << "Скорость: " << speed << "\n";
  std::cout << "=======================\n";
  std::cout << "Оснащение\n";                         
  std::cout << "Двигатель: +" << engine << "\n";     
  std::cout << "Колесо: +" << wheels << "\n";
  std::cout << "Руль: +" << steerinWheel << "\n";
  std::cout << "-----------------------\n";
  std::cout << "Действия плохой погоды\n";            
  std::cout << "Ветер: -" << wind << "\n";
  std::cout << "Дожль: -" << rain << "\n";
}
